# Accessing elements in DataFrames #

In [106]:
import pandas as pd

items = [{'bikes':100, 'pants':25, 'watches':35}, {'bikes':1000, 'cars':10000}]

# will just specify a number for each row label
df_stores = pd.DataFrame(items)
df_stores

   bikes  pants  watches     cars
0    100   25.0     35.0      NaN
1   1000    NaN      NaN  10000.0

In [107]:
# will just specify each row label
df_stores = pd.DataFrame(items, index=['store 1', 'store 2'])
df_stores

         bikes  pants  watches     cars
store 1    100   25.0     35.0      NaN
store 2   1000    NaN      NaN  10000.0

### To get a column of values from the matrix ###

items is a list of lists. So items[[ ]] is referring to the columns list.

In [108]:
df_stores[['bikes']]

         bikes
store 1    100
store 2   1000

In [109]:
df_stores[['bikes', 'pants']]

         bikes  pants
store 1    100   25.0
store 2   1000    NaN

In [110]:
print(df_stores[['bikes']])

         bikes
store 1    100
store 2   1000

You can get a value from the matrix using item[col][row]

In [111]:
df_stores['bikes']['store 2']

1000

### To add a column to a DataFrame ###

In [112]:
df_stores['shirts']= [10, 25]
df_stores

         bikes  pants  watches     cars  shirts
store 1    100   25.0     35.0      NaN      10
store 2   1000    NaN      NaN  10000.0      25

In [113]:
df_stores['suits'] = df_stores['pants'] + df_stores['shirts']
df_stores

         bikes  pants  watches     cars  shirts  suits
store 1    100   25.0     35.0      NaN      10   35.0
store 2   1000    NaN      NaN  10000.0      25    NaN

If you want a new row:

In [114]:
# create a list of 1 dictionary 
new_items = [{'bikes':2, 'watches':10, 'cars':2000}]

# create a DataFrame from that list, and give it an index
new_store = pd.DataFrame(new_items, index=['store 3'])

new_store

         bikes  watches  cars
store 3      2       10  2000

In [115]:
# now append the DataFrame to the df_stores DataFram
df_stores = pd.concat([df_stores, new_store])
df_stores

         bikes  pants  watches     cars  shirts  suits
store 1    100   25.0     35.0      NaN    10.0   35.0
store 2   1000    NaN      NaN  10000.0    25.0    NaN
store 3      2    NaN     10.0   2000.0     NaN    NaN

## To add a column ##

In [116]:
df_stores['new watches']= df_stores['watches'][0:]
df_stores

         bikes  pants  watches     cars  shirts  suits  new watches
store 1    100   25.0     35.0      NaN    10.0   35.0         35.0
store 2   1000    NaN      NaN  10000.0    25.0    NaN          NaN
store 3      2    NaN     10.0   2000.0     NaN    NaN         10.0

## To insert a column ##

use insert(loc, column, values)

In [117]:
df_stores.insert(3, 'shoes', [50, 200, 25])
df_stores

         bikes  pants  watches  shoes     cars  shirts  suits  new watches
store 1    100   25.0     35.0     50      NaN    10.0   35.0         35.0
store 2   1000    NaN      NaN    200  10000.0    25.0    NaN          NaN
store 3      2    NaN     10.0     25   2000.0     NaN    NaN         10.0